import type { Metadata } from "next";
import { Noto_Kufi_Arabic } from "next/font/google";
import "./globals.css";

const notoKufiArabic = Noto_Kufi_Arabic({
  variable: "--font-noto-kufi-arabic",
  subsets: ["arabic"],
});

export const metadata: Metadata = {
  title: "فرصة الاستثمار في المرحلة الأولية - برووج إير",
  description: "انضم إلينا في ثورة تنظيف المباني بإستخدام الطائرات بدون طيار. ونحن نبدأ في مرحلة النمو التالية، نقدم فرص الاستثمار في المرحلة الأولية لتشكيل مستقبل التنظيف بالطائرات بدون طيار في منطقة الشرق الأوسط. تعرف على كيفية أن تكون جزءًا من هذه الرحلة المثيرة.",
  keywords: [
    "طائرة بدون طيار",
    "صناعي",
    "تجاري",
    "المملكة العربية السعودية",
    "تنظيف بالطائرات بدون طيار",
    "تنظيف واجهات المباني بالطائرات بدون طيار",
    "تنظيف ناطحات السحاب بالطائرات بدون طيار",
    "طائرات تنظيف المباني",
    "طائرات تنظيف النوافذ",
    "خدمات التنظيف الجوي",
    "تنظيف الواجهات في السعودية",
    "خدمات الطائرات بدون طيار في السعودية",
    "مشغلو الطائرات بدون طيار المرخصون",
    "تقنية تنظيف مبتكرة",
    "تنظيف احترافي بالطائرات بدون طيار",
    "طائرات تنظيف صديقة للبيئة",
    "تنظيف مستدام بالطائرات بدون طيار",
    "خدمات بروج إير",
    "تنظيف المباني بدون تلامس",
    "حلول طائرات بدون طيار متقدمة",
    "طائرات تنظيف خارجية",
    "أساليب تنظيف عالية التقنية",
    "شركة تنظيف بالطائرات بدون طيار في السعودية",
    "أول شركة مرخصة للتنظيف بالطائرات بدون طيار في السعودية"
  ],
  openGraph: {
    title: "فرصة الاستثمار في المرحلة الأولية - برووج إير",
    description: "انضم إلينا في ثورة تنظيف المباني بإستخدام الطائرات بدون طيار. ونحن نبدأ في مرحلة النمو التالية، نقدم فرص الاستثمار في المرحلة الأولية لتشكيل مستقبل التنظيف بالطائرات بدون طيار في منطقة الشرق الأوسط. تعرف على كيفية أن تكون جزءًا من هذه الرحلة المثيرة.",
    images: [
      {
        url: "https://buroojair.com/images/BuroojAir.png",
        width: 1200,
        height: 630,
        alt: "فرصة الاستثمار في المرحلة الأولية - برووج إير"
      }
    ],
    url: "https://seed.buroojair.com/",
    type: "website",
    locale: "ar_SA",
  },
  twitter: {
    card: "summary_large_image",
    title: "فرصة الاستثمار في المرحلة الأولية - برووج إير",
    description: "انضم إلينا في ثورة تنظيف المباني بإستخدام الطائرات بدون طيار. ونحن نبدأ في مرحلة النمو التالية، نقدم فرص الاستثمار في المرحلة الأولية لتشكيل مستقبل التنظيف بالطائرات بدون طيار في منطقة الشرق الأوسط. تعرف على كيفية أن تكون جزءًا من هذه الرحلة المثيرة.",
    images: ["https://buroojair.com/images/BuroojAir.png"],
    site: "@buroojair",
  },
};

export default function RootLayout({
  children,
}: Readonly<{
  children: React.ReactNode;
}>) {
  return (
    <html lang="ar" dir="rtl">
      <body
        className={`${notoKufiArabic.variable} antialiased`}
      >
        {children}
      </body>
    </html>
  );
}
